#+title: Emacs Configuration

** Package management
 #+begin_src emacs-lisp
   ;; package management
   (require 'package)

   (setq package-enable-at-startup nil) ; Don't initialize later as well
   (setq package-check-signature nil)
   (add-to-list 'package-archives
                '("melpa" . "https://melpa.org/packages/"))

   (setq package-user-dir (concat user-emacs-directory "vendors"))

   (package-initialize)

   ; Fetch the list of packages available
   (unless package-archive-contents
     (package-refresh-contents))

   ;; use-package
   (unless (package-installed-p 'use-package)
     (package-refresh-contents)
     (package-install 'use-package))

   (eval-when-compile
     (require 'use-package))

   (setq use-package-always-ensure      t
         backup-directory-alist         `((".*" . ,temporary-file-directory))
         auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))

   ;; (use-package quelpa-use-package
   ;;   :init
   ;;   (setq quela-update-melpa-p nil))

   ;; (quelpa
   ;;  '(quelpa-use-package
   ;;    :fetcher git
   ;;    :url "https://github.com/quelpa/quelpa-use-package.git"))
   ;; (require 'quelpa-use-package)

   ;; (unless (package-installed-p 'quelpa)
   ;;     (with-temp-buffer
   ;;       (url-insert-file-contents "https://github.com/quelpa/quelpa/raw/master/quelpa.el")
   ;;       (eval-buffer)
   ;;       (quelpa-self-upgrade)))

   ;; (eval-when-compile
   ;;   (require 'quelpa))
 #+end_src

 #+RESULTS:
 | .* | /var/folders/j0/ggbz71xx5b3dk78z054c22xh0000gn/T/ | t |

